Roshan12072000/stm32_baremetal_programming/Bmtl_Integration_Project/Src/main.c
#include "stm32l476xx_gpio_driver.h"
#include "STM32_SPI_Driver.h"
#include "stm32l476xx_i2c_driver.h"
#include "stm32l476xx_uart_driver.h"
#include <stdint.h>
#include <string.h>
#include <stdio.h>

extern SPI_Handle_t SPI1Handle;
extern I2C_Handle_t I2C1Handle;

void delay(void);
void W25Q_WriteEnable(void);
uint8_t W25Q_ReadStatus(void);
void W25Q_WaitBusy(void);

void W25Q_ReadID(void);
void W25Q_EraseSector(uint32_t addr);

void W25Q_Write(uint32_t addr, uint8_t *data, uint16_t len);
void W25Q_Read(uint32_t addr, uint8_t *data, uint16_t len);
void Store_Lux(uint16_t lux);
void Print_Recent_Logs(void);

uint8_t cmd_buf[4];

#define MAX_LOGS          5
#define FLASH_BASE_ADDR   0x000000

uint32_t flash_write_addr = FLASH_BASE_ADDR;

uint8_t write_index = 0;
uint8_t total_logs = 0;


char tx_buf[] = "Hello this is from Flash Memory";
char rx_buf[50];

void  EXTI15_10_IRQHandler(void){
	   delay();
    	GPIO_IRQHandling(GPIO_PIN_NO_13);
    	Print_Recent_Logs();
    }

uint8_t config[3];
uint8_t reg = 0x00;
uint8_t data[2];

uint16_t raw;
uint16_t exponent;
uint16_t mantissa;
uint8_t reg_addr = 0x00;
uint8_t sensor_data;int lux;
int main(void)
{
    /*
     * UART INIT
     */
    UART2_GPIOInits();

    UART2_Init();

    /*
     * GPIO INTERRUPT INIT
     */
    gpio_pin_init();

    /*
     * SPI INIT
     */
    SPI_GPIO_Init();

    SPI1_Inits();
    SPI_PeripheralControl(SPI1, ENABLE);
    W25Q_EraseSector(FLASH_BASE_ADDR);
    /*
     * I2C INIT
     */
    I2C1_GPIOInits();

    I2C1_Inits();

    /*
     * ERASE FLASH SECTOR
     */
    W25Q_EraseSector(FLASH_BASE_ADDR);
    char msg[50];
    while(1)
    {
        /************************************************
         * SENSOR CONFIG
         ***********************************************/
        config[0] = 0x01;
        config[1] = 0xC4;
        config[2] = 0x10;

        I2C_MasterSendData(&I2C1Handle,
                           config,
                           3,
                           0x47);

        delay();

        /************************************************
         * SELECT RESULT REGISTER
         ***********************************************/
        I2C_MasterSendData(&I2C1Handle,
                           &reg,
                           1,
                           0x47);

        /************************************************
         * READ SENSOR DATA
         ***********************************************/
        I2C_MasterReceiveData(&I2C1Handle,
                              data,
                              2,
                              0x47);

        /************************************************
         * LUX CALCULATION
         ***********************************************/
        raw =
          (data[0] << 8) | data[1];

        exponent =
          (raw >> 12) & 0x0F;

        mantissa =
          raw & 0x0FFF;

        lux =
          (mantissa * (1 << exponent)) / 100;

        /************************************************
         * STORE INTO FLASH
         ***********************************************/
        sprintf(msg,
                "Lux = %d\r\n",
                lux);

        UART_SendData((uint8_t*)msg,
                      strlen(msg));
        Store_Lux(lux);

        delay();
    }
}

void delay(void)
{
    for(uint32_t i = 0; i < 500000/2; i++);
}


// flash definations


/****************************************************************
 * WRITE ENABLE
 ***************************************************************/
void W25Q_WriteEnable(void)
{
    uint8_t cmd = 0x06;

    CS_LOW();

    SPI_SendData(SPI1, &cmd, 1);

    while(SPI_GetFlagStatus(SPI1, SPI_BUSY_FLAG));

    CS_HIGH();
}

/****************************************************************
 * READ STATUS REGISTER
 ***************************************************************/
uint8_t W25Q_ReadStatus(void)
{
    uint8_t cmd = 0x05;
    uint8_t status = 0;

    CS_LOW();

    SPI_SendData(SPI1, &cmd, 1);

    SPI_ReceiveData(SPI1, &status, 1);

    while(SPI_GetFlagStatus(SPI1, SPI_BUSY_FLAG));

    CS_HIGH();

    return status;
}

/****************************************************************
 * WAIT UNTIL FLASH FREE
 ***************************************************************/
void W25Q_WaitBusy(void)
{
    while(W25Q_ReadStatus() & 0x01);
}

/****************************************************************
 * READ JEDEC ID
 ***************************************************************/
uint8_t id[3];
void W25Q_ReadID(void)
{
    uint8_t cmd = 0x9F;
//    uint8_t id[3];

    CS_LOW();

    SPI_SendData(SPI1, &cmd, 1);

    SPI_ReceiveData(SPI1, id, 3);

    while(SPI_GetFlagStatus(SPI1, SPI_BUSY_FLAG));

    CS_HIGH();

    // Expected:
    // EF 40 16 for W25Q32
}

/****************************************************************
 * ERASE SECTOR
 ***************************************************************/
void W25Q_EraseSector(uint32_t addr)
{
    uint8_t cmd[4];

    W25Q_WriteEnable();

    cmd[0] = 0x20;

    cmd[1] = (addr >> 16) & 0xFF;
    cmd[2] = (addr >> 8) & 0xFF;
    cmd[3] = addr & 0xFF;

    CS_LOW();

    SPI_SendData(SPI1, cmd, 4);

    while(SPI_GetFlagStatus(SPI1, SPI_BUSY_FLAG));

    CS_HIGH();

    W25Q_WaitBusy();
}

/****************************************************************
 * WRITE DATA
 ***************************************************************/
void W25Q_Write(uint32_t addr, uint8_t *data, uint16_t len)
{
    uint8_t cmd[4];

    W25Q_WriteEnable();

    cmd[0] = 0x02;

    cmd[1] = (addr >> 16) & 0xFF;
    cmd[2] = (addr >> 8) & 0xFF;
    cmd[3] = addr & 0xFF;

    CS_LOW();

    SPI_SendData(SPI1, cmd, 4);

    SPI_SendData(SPI1, data, len);

    while(SPI_GetFlagStatus(SPI1, SPI_BUSY_FLAG));

    CS_HIGH();

    W25Q_WaitBusy();
}

/****************************************************************
 * READ DATA
 ***************************************************************/
void W25Q_Read(uint32_t addr, uint8_t *data, uint16_t len)
{
    uint8_t cmd[4];

    cmd[0] = 0x03;

    cmd[1] = (addr >> 16) & 0xFF;
    cmd[2] = (addr >> 8) & 0xFF;
    cmd[3] = addr & 0xFF;

    CS_LOW();

    SPI_SendData(SPI1, cmd, 4);

    SPI_ReceiveData(SPI1, data, len);

    while(SPI_GetFlagStatus(SPI1, SPI_BUSY_FLAG));

    CS_HIGH();
}
void Print_Recent_Logs(void)
{
    uint16_t lux;

    char msg[50];

    uint32_t addr;

    if(flash_write_addr <= FLASH_BASE_ADDR)
    {
        return;
    }

    addr = flash_write_addr - 2;

    for(uint8_t i = 0;
        i < MAX_LOGS;
        i++)
    {
        if(addr < FLASH_BASE_ADDR)
        {
            break;
        }

        W25Q_Read(addr,
                  (uint8_t*)&lux,
                  2);

        sprintf(msg,
                "Lux = %d\r\n",
                lux);

        UART_SendData((uint8_t*)msg,
                      strlen(msg));

        if(addr >= 2)
        {
            addr -= 2;
        }
        else
        {
            break;
        }
    }
}
void Store_Lux(uint16_t lux)
{
    W25Q_Write(flash_write_addr,
               (uint8_t*)&lux,
               2);

    flash_write_addr += 2;
}
